app/controllers/api/v1/items_controller.rb

  def index
    respond_with Item.all
---
SELECT "items".* FROM "items"

  def create
    respond_with :api, :v1, Item.create(item_params)
---
INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Stephen"], ["description", "Does stuff"], ["created_at", 2017-04-12 02:28:23 UTC], ["updated_at", 2017-04-12 02:28:23 UTC]]